moneybackend/1c/расширения/InformationRegisters/DjНастройкиСоединения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>DjНастройкиСоединения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Токен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛимитОчередиСинхронизации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Активно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

moneybackend/1c/расширения/InformationRegisters/DjСписокОбменаССайтом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>DjСписокОбменаССайтом</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>СсылкаОбъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Кошельки</v8:Type>
						<v8:Type>cfg:DocumentRef.Расходы</v8:Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:DocumentRef.Приходы</v8:Type>
						<v8:Type>cfg:CatalogRef.Статьи</v8:Type>
						<v8:Type>cfg:DocumentRef.Автоплатежи</v8:Type>
						<v8:Type>cfg:DocumentRef.Бюджет</v8:Type>
						<v8:Type>cfg:DocumentRef.Переводы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

moneybackend/1c/расширения/Enums/ВидБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВидБюджета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

moneybackend/1c/расширения/CommonModules/DjОбмен/Ext/Module.bsl
#Область  Запросы
Функция ОтправитьHTTPЗапрос(Метод, АдресРесурса, ДанныеДляЗапроса = Неопределено) Экспорт 
	DjНастройкиСоединения = ПолучитьНастройкиСоединения();
	Если DjНастройкиСоединения = Неопределено Тогда
		ДанныеВозврата = Новый Структура;
		ДанныеВозврата.Вставить("Код", 0);
		ДанныеВозврата.Вставить("Тело", "Не указаны настройки соединения");
		Возврат ДанныеВозврата;
	КонецЕсли;
	
	Попытка
		HTTPСоединение = СоздатьHTTPСоединение(DjНастройкиСоединения);
	Исключение
		ДанныеВозврата = Новый Структура;
		ДанныеВозврата.Вставить("Код", 0);
		ДанныеВозврата.Вставить("Тело", ОписаниеОшибки());
		Возврат ДанныеВозврата;
	КонецПопытки;
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Authorization", "Token "+ DjНастройкиСоединения.Токен);
	Заголовки.Вставить("Content-Type","application/json");
	Заголовки.Вставить("X-OneC-Sync", "1");
	
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса, Заголовки);
	Если не ДанныеДляЗапроса = Неопределено Тогда
		HTTPЗапрос.УстановитьТелоИзСтроки( СформироватьJSON(ДанныеДляЗапроса),КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	КонецЕсли;
	
	Результат = HTTPСоединение.ВызватьHTTPМетод(Метод, HTTPЗапрос);
	
	ДанныеВозврата = Новый Структура;
	ДанныеВозврата.Вставить("Код", Результат.КодСостояния);
	ДанныеВозврата.Вставить("Тело",Результат.ПолучитьТелоКакСтроку());
	
	Возврат ДанныеВозврата;
КонецФункции

Функция СоздатьHTTPСоединение(НастройкиСоединения)
	ПараметрыСоединения = ПодготовитьПараметрыHTTPСоединения(НастройкиСоединения);
	ЗащищенноеСоединение = Неопределено;
	
	Если ПараметрыСоединения.ИспользоватьHTTPS Тогда
		ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();
	КонецЕсли;
	
	Возврат Новый HTTPСоединение(
		ПараметрыСоединения.Адрес,
		ПараметрыСоединения.Порт,
		,
		,
		,
		,
		ЗащищенноеСоединение
	);
КонецФункции

Функция ПодготовитьПараметрыHTTPСоединения(НастройкиСоединения)
	Адрес = СокрЛП(НастройкиСоединения.Адрес);
	Порт = НастройкиСоединения.Порт;
	ИспользоватьHTTPS = Ложь;
	АдресВНижнемРегистре = НРег(Адрес);
	
	Если Лев(АдресВНижнемРегистре, 8) = "https://" Тогда
		ИспользоватьHTTPS = Истина;
		Адрес = Сред(Адрес, 9);
	ИначеЕсли Лев(АдресВНижнемРегистре, 7) = "http://" Тогда
		Адрес = Сред(Адрес, 8);
	ИначеЕсли Порт = 443 Тогда
		ИспользоватьHTTPS = Истина;
	КонецЕсли;
	
	ПозицияСлэша = СтрНайти(Адрес, "/");
	Если ПозицияСлэша > 0 Тогда
		Адрес = Лев(Адрес, ПозицияСлэша - 1);
	КонецЕсли;
	
	Адрес = СокрЛП(Адрес);
	Если НЕ ЗначениеЗаполнено(Адрес) Тогда
		ВызватьИсключение "Не заполнен адрес сервера обмена.";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Порт) Тогда
		Порт = ?(ИспользоватьHTTPS, 443, 80);
	КонецЕсли;
	
	ПараметрыСоединения = Новый Структура;
	ПараметрыСоединения.Вставить("Адрес", Адрес);
	ПараметрыСоединения.Вставить("Порт", Порт);
	ПараметрыСоединения.Вставить("ИспользоватьHTTPS", ИспользоватьHTTPS);
	Возврат ПараметрыСоединения;
КонецФункции

Функция ПолучитьНастройкиСоединения()
	НастройкиСоединения = РегистрыСведений.DjНастройкиСоединения.Выбрать(Новый Структура("Активно", Истина));
	Если НЕ НастройкиСоединения.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат НастройкиСоединения;
КонецФункции

Функция ПолучитьАдресРесурса(URL,СсылкаНаОбъект = Неопределено)
	АдресAPI = "api/v1/";
	Если СсылкаНаОбъект = Неопределено Тогда 
		Возврат СтрШаблон("%1%2/",АдресAPI,URL);
	Иначе                                 
		Возврат СтрШаблон("%1%2/%3/",АдресAPI,URL, XMLСтрока(СсылкаНаОбъект));
	КонецЕсли;	
КонецФункции

Функция СформироватьСтрокиГрафикаДляЗапроса(ТабличнаяЧасть, ИмяПоляПериода)
	СтрокиГрафика = Новый Массив;
	Для каждого СтрокаТабличнойЧасти Из ТабличнаяЧасть Цикл
		СтрокаГрафика = Новый Структура;
		Если ИмяПоляПериода = "Период" Тогда
			СтрокаГрафика.Вставить("date_start", СтрокаТабличнойЧасти.Период);
		ИначеЕсли ИмяПоляПериода = "ПериодБюджетирования" Тогда
			СтрокаГрафика.Вставить("date_start", СтрокаТабличнойЧасти.ПериодБюджетирования);
		Иначе
			ВызватьИсключение СтрШаблон("Неизвестное поле периода табличной части: %1.", ИмяПоляПериода);
		КонецЕсли;
		СтрокаГрафика.Вставить("amount", СтрокаТабличнойЧасти.Сумма);
		СтрокиГрафика.Добавить(СтрокаГрафика);
	КонецЦикла;
	
	Возврат СтрокиГрафика;
КонецФункции

Функция СформироватьЗапросЗаменыГрафика(АдресРесурса, СтрокиГрафика)
	ЗапросНаЗаменуГрафика = Новый Структура;
	ДанныеДляЗапроса = Новый Структура;
	ЗапросНаЗаменуГрафика.Вставить("Метод", "PUT");
	ЗапросНаЗаменуГрафика.Вставить("АдресРесурса", АдресРесурса);
	ДанныеДляЗапроса.Вставить("rows", СтрокиГрафика);
	ЗапросНаЗаменуГрафика.Вставить("ДанныеДляЗапроса", ДанныеДляЗапроса);
	
	Возврат ЗапросНаЗаменуГрафика;
КонецФункции

Функция ЭтоУспешныйКодHTTP(КодСостояния)
	Возврат КодСостояния = 200 ИЛИ КодСостояния = 201 ИЛИ КодСостояния = 204;
КонецФункции

Функция НормализоватьЛимитОчередиСинхронизации(Лимит, ЗначениеПоУмолчанию = 100)
	НормализованныйЛимит = ЗначениеПоУмолчанию;
	
	Если ТипЗнч(Лимит) = Тип("Число") Тогда
		НормализованныйЛимит = Лимит;
	ИначеЕсли ТипЗнч(Лимит) = Тип("Строка") И ЗначениеЗаполнено(Лимит) Тогда
		Попытка
			НормализованныйЛимит = XMLЗначение(Тип("Число"), Лимит);
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Если НормализованныйЛимит < 1 Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Если НормализованныйЛимит > 5000 Тогда
		Возврат 5000;
	КонецЕсли;
	
	Возврат НормализованныйЛимит;
КонецФункции

Функция ПолучитьЛимитЗагрузкиИзмененийСайта(Лимит = Неопределено)
	Если Лимит <> Неопределено Тогда
		Возврат НормализоватьЛимитОчередиСинхронизации(Лимит);
	КонецЕсли;
	
	НастройкиСоединения = ПолучитьНастройкиСоединения();
	Если НастройкиСоединения = Неопределено Тогда
		Возврат 100;
	КонецЕсли;
	
	Возврат НормализоватьЛимитОчередиСинхронизации(НастройкиСоединения.ЛимитОчередиСинхронизации);
КонецФункции

Функция ПолучитьСтрокуЛимитаОчередиСинхронизации(Лимит)
	Цифры = "0123456789";
	ЦелыйЛимит = Цел(НормализоватьЛимитОчередиСинхронизации(Лимит));
	СтрокаЛимита = "";
	
	Если ЦелыйЛимит <= 0 Тогда
		Возврат "100";
	КонецЕсли;
	
	Пока ЦелыйЛимит > 0 Цикл
		Остаток = ЦелыйЛимит - 10 * Цел(ЦелыйЛимит / 10);
		СтрокаЛимита = Сред(Цифры, Остаток + 1, 1) + СтрокаЛимита;
		ЦелыйЛимит = Цел(ЦелыйЛимит / 10);
	КонецЦикла;
	
	Возврат СтрокаЛимита;
КонецФункции


	 
#КонецОбласти


#Область ВспомогательныеФункции
Функция ПолучитьЗначениеJSON(Контейнер, ИмяКлюча, ЗначениеПоУмолчанию = Неопределено)
	Перем Значение;
	Если Контейнер = Неопределено Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Если ТипЗнч(Контейнер) = Тип("Соответствие") Тогда
		Значение = Контейнер.Получить(ИмяКлюча);
		Если Значение <> Неопределено Тогда
			Возврат Значение;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Контейнер) = Тип("Структура") Тогда
		Если Контейнер.Свойство(ИмяКлюча, Значение) Тогда
			Возврат Значение;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЗначениеПоУмолчанию;
КонецФункции

Функция НормализоватьДатуJSON(Значение, ЗначениеПоУмолчанию = Неопределено)
	Если Значение = Неопределено Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;

	Если ТипЗнч(Значение) = Тип("Дата") Тогда
		Возврат Значение;
	КонецЕсли;

	Если ТипЗнч(Значение) = Тип("Строка") И ЗначениеЗаполнено(Значение) Тогда
		Попытка
			Возврат XMLЗначение(Тип("Дата"), Значение);
		Исключение
		КонецПопытки;
	КонецЕсли;

	Возврат ЗначениеПоУмолчанию;
КонецФункции

Функция ПолучитьДатуJSON(Контейнер, ИмяКлюча, ЗначениеПоУмолчанию = Неопределено)
	Возврат НормализоватьДатуJSON(ПолучитьЗначениеJSON(Контейнер, ИмяКлюча), ЗначениеПоУмолчанию);
КонецФункции

Функция НормализоватьЧислоJSON(Значение, ЗначениеПоУмолчанию = 0)
	Если Значение = Неопределено Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;

	Если ТипЗнч(Значение) = Тип("Число") Тогда
		Возврат Значение;
	КонецЕсли;

	Если ТипЗнч(Значение) = Тип("Строка") И ЗначениеЗаполнено(Значение) Тогда
		Попытка
			Возврат XMLЗначение(Тип("Число"), Значение);
		Исключение
		КонецПопытки;
	КонецЕсли;

	Возврат ЗначениеПоУмолчанию;
КонецФункции

Функция ПолучитьЧислоJSON(Контейнер, ИмяКлюча, ЗначениеПоУмолчанию = 0)
	Возврат НормализоватьЧислоJSON(ПолучитьЗначениеJSON(Контейнер, ИмяКлюча), ЗначениеПоУмолчанию);
КонецФункции

Процедура УвеличитьЗначениеСтруктуры(СтруктураЗначений, ИмяПоля, Шаг = 1)
	ТекущееЗначение = 0;
	СтруктураЗначений.Свойство(ИмяПоля, ТекущееЗначение);
	СтруктураЗначений.Вставить(ИмяПоля, ТекущееЗначение + Шаг);
КонецПроцедуры

Функция ПолучитьСсылкуПоUUID(МенеджерОбъекта, СтрокаUUID)
	Если НЕ ЗначениеЗаполнено(СтрокаUUID) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат МенеджерОбъекта.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаUUID));
КонецФункции

Функция ПолучитьСсылкуПоМаршруту(Маршрут, СтрокаUUID)
	Если НЕ ЗначениеЗаполнено(СтрокаUUID) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Маршрут = "wallets" Тогда
		Возврат ПолучитьСсылкуПоUUID(Справочники.Кошельки, СтрокаUUID);
	ИначеЕсли Маршрут = "projects" Тогда
		Возврат ПолучитьСсылкуПоUUID(Справочники.Проекты, СтрокаUUID);
	ИначеЕсли Маршрут = "cash-flow-items" Тогда
		Возврат ПолучитьСсылкуПоUUID(Справочники.Статьи, СтрокаUUID);
	ИначеЕсли Маршрут = "users" Тогда
		Возврат ПолучитьСсылкуПоUUID(Справочники.Контрагенты, СтрокаUUID);
	ИначеЕсли Маршрут = "receipts" Тогда
		Возврат ПолучитьСсылкуПоUUID(Документы.Приходы, СтрокаUUID);
	ИначеЕсли Маршрут = "expenditures" Тогда
		Возврат ПолучитьСсылкуПоUUID(Документы.Расходы, СтрокаUUID);
	ИначеЕсли Маршрут = "transfers" Тогда
		Возврат ПолучитьСсылкуПоUUID(Документы.Переводы, СтрокаUUID);
	ИначеЕсли Маршрут = "budgets" Тогда
		Возврат ПолучитьСсылкуПоUUID(Документы.Бюджет, СтрокаUUID);
	ИначеЕсли Маршрут = "auto-payments" Тогда
		Возврат ПолучитьСсылкуПоUUID(Документы.Автоплатежи, СтрокаUUID);
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

Функция СоздатьОбъектПоМаршруту(Маршрут)
	Если Маршрут = "wallets" Тогда
		Возврат Справочники.Кошельки.СоздатьЭлемент();
	ИначеЕсли Маршрут = "projects" Тогда
		Возврат Справочники.Проекты.СоздатьЭлемент();
	ИначеЕсли Маршрут = "cash-flow-items" Тогда
		Возврат Справочники.Статьи.СоздатьЭлемент();
	ИначеЕсли Маршрут = "users" Тогда
		Возврат Справочники.Контрагенты.СоздатьЭлемент();
	ИначеЕсли Маршрут = "receipts" Тогда
		Возврат Документы.Приходы.СоздатьДокумент();
	ИначеЕсли Маршрут = "expenditures" Тогда
		Возврат Документы.Расходы.СоздатьДокумент();
	ИначеЕсли Маршрут = "transfers" Тогда
		Возврат Документы.Переводы.СоздатьДокумент();
	ИначеЕсли Маршрут = "budgets" Тогда
		Возврат Документы.Бюджет.СоздатьДокумент();
	ИначеЕсли Маршрут = "auto-payments" Тогда
		Возврат Документы.Автоплатежи.СоздатьДокумент();
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

Функция ПолучитьИлиСоздатьОбъектПоМаршруту(Маршрут, СтрокаUUID)
	СсылкаНаОбъект = ПолучитьСсылкуПоМаршруту(Маршрут, СтрокаUUID);
	Если СсылкаНаОбъект = Неопределено Тогда
		ВызватьИсключение СтрШаблон("Не удалось получить ссылку по маршруту %1.", Маршрут);
	КонецЕсли;
	
	Объект = Неопределено;
	Попытка
		Объект = СсылкаНаОбъект.ПолучитьОбъект();
	Исключение
	КонецПопытки;
	Если Объект <> Неопределено Тогда
		Возврат Объект;
	КонецЕсли;
	
	Объект = СоздатьОбъектПоМаршруту(Маршрут);
	Если Объект = Неопределено Тогда
		ВызватьИсключение СтрШаблон("Не удалось создать объект по маршруту %1.", Маршрут);
	КонецЕсли;
	
	Объект.УстановитьСсылкуНового(СсылкаНаОбъект);
	Возврат Объект;
КонецФункции

Процедура ЗаписатьОбъектИзОбмена(Объект)
	Если Объект = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();
КонецПроцедуры

Процедура ЗаполнитьГрафикДокумента(ТабличнаяЧасть, МассивСтрокГрафика, ИмяПоляПериода)
	ТабличнаяЧасть.Очистить();
	Если МассивСтрокГрафика = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаГрафика Из МассивСтрокГрафика Цикл
		НоваяСтрока = ТабличнаяЧасть.Добавить();
		Если ИмяПоляПериода = "Период" Тогда
			НоваяСтрока.Период = ПолучитьДатуJSON(СтрокаГрафика, "date_start");
		ИначеЕсли ИмяПоляПериода = "ПериодБюджетирования" Тогда
			НоваяСтрока.ПериодБюджетирования = ПолучитьДатуJSON(СтрокаГрафика, "date_start");
		Иначе
			ВызватьИсключение СтрШаблон("Неизвестное поле периода табличной части: %1.", ИмяПоляПериода);
		КонецЕсли;
		НоваяСтрока.Сумма = ПолучитьЧислоJSON(СтрокаГрафика, "amount");
	КонецЦикла;
КонецПроцедуры

Процедура ПрименитьПометкуУдаления(Маршрут, СтрокаUUID, ПолезнаяНагрузка)
	СсылкаНаОбъект = ПолучитьСсылкуПоМаршруту(Маршрут, СтрокаUUID);
	Если СсылкаНаОбъект = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		Объект = СсылкаНаОбъект.ПолучитьОбъект();
	Исключение
		Возврат;
	КонецПопытки;
	
	Если Маршрут = "users" Тогда
		Объект.ПометкаУдаления = НЕ ПолучитьЗначениеJSON(ПолезнаяНагрузка, "is_active", Ложь);
	Иначе
		Объект.ПометкаУдаления = Истина;
	КонецЕсли;
	
	ЗаписатьОбъектИзОбмена(Объект);
КонецПроцедуры

Процедура ЗаполнитьОбъектИзСайта(Маршрут, Объект, ПолезнаяНагрузка)
	Если Маршрут = "wallets" Тогда
		Объект.Код = ПолучитьЗначениеJSON(ПолезнаяНагрузка, "code");
		Объект.Наименование = ПолучитьЗначениеJSON(ПолезнаяНагрузка, "name");
		Объект.Скрыть = ПолучитьЗначениеJSON(ПолезнаяНагрузка, "hidden", Ложь);
		Объект.ПометкаУдаления = ПолучитьЗначениеJSON(ПолезнаяНагрузка, "deleted", Ложь);
	ИначеЕсли Маршрут = "projects" Тогда
		Объект.Код = ПолучитьЗначениеJSON(ПолезнаяНагрузка, "code");
		Объект.Наименование = ПолучитьЗначениеJSON(ПолезнаяНагрузка, "name");
		Объект.ПометкаУдаления = ПолучитьЗначениеJSON(ПолезнаяНагрузка, "deleted", Ложь);
	ИначеЕсли Маршрут = "cash-flow-items" Тогда
		Объект.Код = ПолучитьЗначениеJSON(ПолезнаяНагрузка, "code");
		Объект.Наименование = ПолучитьЗначениеJSON(ПолезнаяНагрузка, "name");
		Если НЕ Объект.ЭтоГруппа Тогда
			Объект.УчитыватьВБюджете = ПолучитьЗначениеJSON(ПолезнаяНагрузка, "include_in_budget");
		КонецЕсли;
		Объект.Родитель = ПолучитьСсылкуПоМаршруту("cash-flow-items", ПолучитьЗначениеJSON(ПолезнаяНагрузка, "parent"));
		Объект.ПометкаУдаления = ПолучитьЗначениеJSON(ПолезнаяНагрузка, "deleted", Ложь);
	ИначеЕсли Маршрут = "users" Тогда
		Если ТипЗнч(Объект) = Тип("СправочникСсылка.Контрагенты") Тогда
			Объект = Объект.ПолучитьОбъект();
		КонецЕсли;
		Если ТипЗнч(Объект) <> Тип("СправочникОбъект.Контрагенты") Тогда
			ВызватьИсключение СтрШаблон(
				"Для маршрута %1 ожидался объект каталога Контрагенты, получено: %2.",
				Маршрут,
				ТипЗнч(Объект)
			);
		КонецЕсли;
		ИНН = ПолучитьЗначениеJSON(ПолезнаяНагрузка, "tax_id", ПолучитьЗначениеJSON(ПолезнаяНагрузка, "username"));
		Объект.ИНН = ИНН;
		Объект.НаименованиеПолное = ПолучитьЗначениеJSON(ПолезнаяНагрузка, "full_name");
		Если ЗначениеЗаполнено(Объект.НаименованиеПолное) Тогда
			Объект.Наименование = Объект.НаименованиеПолное;
		ИначеЕсли ЗначениеЗаполнено(ИНН) Тогда
			Объект.Наименование = ИНН;
		КонецЕсли;
		Если ПолучитьЗначениеJSON(ПолезнаяНагрузка, "status") = "COMP" Тогда
			Объект.Юрлицо = Перечисления.ЮрЛицо.ЮрЛицо;
		Иначе
			Объект.Юрлицо = Перечисления.ЮрЛицо.ФизЛицо;
		КонецЕсли;
		Если ЗначениеЗаполнено(ПолучитьЗначениеJSON(ПолезнаяНагрузка, "password")) Тогда
			Объект.Пароль = ПолучитьЗначениеJSON(ПолезнаяНагрузка, "password");
		КонецЕсли;
		Объект.ПометкаУдаления = НЕ ПолучитьЗначениеJSON(ПолезнаяНагрузка, "is_active", Истина);
	ИначеЕсли Маршрут = "receipts" Тогда
		Объект.Номер = ПолучитьЗначениеJSON(ПолезнаяНагрузка, "number");
		Объект.Дата = ПолучитьДатуJSON(ПолезнаяНагрузка, "date");
		Объект.Сумма = ПолучитьЧислоJSON(ПолезнаяНагрузка, "amount");
		Объект.Комментарий = ПолучитьЗначениеJSON(ПолезнаяНагрузка, "comment");
		Объект.Кошелек = ПолучитьСсылкуПоМаршруту("wallets", ПолучитьЗначениеJSON(ПолезнаяНагрузка, "wallet"));
		Объект.Статья = ПолучитьСсылкуПоМаршруту("cash-flow-items", ПолучитьЗначениеJSON(ПолезнаяНагрузка, "cash_flow_item"));
		Объект.ПометкаУдаления = ПолучитьЗначениеJSON(ПолезнаяНагрузка, "deleted", Ложь);
	ИначеЕсли Маршрут = "expenditures" Тогда
		Объект.Номер = ПолучитьЗначениеJSON(ПолезнаяНагрузка, "number");
		Объект.Дата = ПолучитьДатуJSON(ПолезнаяНагрузка, "date");
		Объект.Сумма = ПолучитьЧислоJSON(ПолезнаяНагрузка, "amount");
		Объект.Комментарий = ПолучитьЗначениеJSON(ПолезнаяНагрузка, "comment");
		Объект.Кошелек = ПолучитьСсылкуПоМаршруту("wallets", ПолучитьЗначениеJSON(ПолезнаяНагрузка, "wallet"));
		Объект.Статья = ПолучитьСсылкуПоМаршруту("cash-flow-items", ПолучитьЗначениеJSON(ПолезнаяНагрузка, "cash_flow_item"));
		Объект.УчитыватьВБюджете = ПолучитьЗначениеJSON(ПолезнаяНагрузка, "include_in_budget", Истина);
		Объект.ПометкаУдаления = ПолучитьЗначениеJSON(ПолезнаяНагрузка, "deleted", Ложь);
		ЗаполнитьГрафикДокумента(Объект.БюджетныйПериод, ПолучитьЗначениеJSON(ПолезнаяНагрузка, "graphics"), "ПериодБюджетирования");
	ИначеЕсли Маршрут = "transfers" Тогда
		Объект.Номер = ПолучитьЗначениеJSON(ПолезнаяНагрузка, "number");
		Объект.Дата = ПолучитьДатуJSON(ПолезнаяНагрузка, "date");
		Объект.Сумма = ПолучитьЧислоJSON(ПолезнаяНагрузка, "amount");
		Объект.Комментарий = ПолучитьЗначениеJSON(ПолезнаяНагрузка, "comment");
		Объект.КошелекОткуда = ПолучитьСсылкуПоМаршруту("wallets", ПолучитьЗначениеJSON(ПолезнаяНагрузка, "wallet_out"));
		Объект.КошелекКуда = ПолучитьСсылкуПоМаршруту("wallets", ПолучитьЗначениеJSON(ПолезнаяНагрузка, "wallet_in"));
		Объект.Статья = ПолучитьСсылкуПоМаршруту("cash-flow-items", ПолучитьЗначениеJSON(ПолезнаяНагрузка, "cash_flow_item"));
		Объект.УчитыватьВБюджете = ПолучитьЗначениеJSON(ПолезнаяНагрузка, "include_in_budget", Ложь);
		Объект.ПометкаУдаления = ПолучитьЗначениеJSON(ПолезнаяНагрузка, "deleted", Ложь);
		ЗаполнитьГрафикДокумента(Объект.БюджетныйПериод, ПолучитьЗначениеJSON(ПолезнаяНагрузка, "graphics"), "ПериодБюджетирования");
	ИначеЕсли Маршрут = "budgets" Тогда
		Объект.Номер = ПолучитьЗначениеJSON(ПолезнаяНагрузка, "number");
		Объект.Дата = ПолучитьДатуJSON(ПолезнаяНагрузка, "date");
		Объект.Сумма = ПолучитьЧислоJSON(ПолезнаяНагрузка, "amount");
		Объект.ДатаНачала = ПолучитьДатуJSON(ПолезнаяНагрузка, "date_start");
		Объект.Комментарий = ПолучитьЗначениеJSON(ПолезнаяНагрузка, "comment");
		Объект.Статья = ПолучитьСсылкуПоМаршруту("cash-flow-items", ПолучитьЗначениеJSON(ПолезнаяНагрузка, "cash_flow_item"));
		Объект.Проект = ПолучитьСсылкуПоМаршруту("projects", ПолучитьЗначениеJSON(ПолезнаяНагрузка, "project"));
		Объект.КолвоМесяцев = ПолучитьЧислоJSON(ПолезнаяНагрузка, "amount_month");
		Объект.ПометкаУдаления = ПолучитьЗначениеJSON(ПолезнаяНагрузка, "deleted", Ложь);
		Если ПолучитьЗначениеJSON(ПолезнаяНагрузка, "type_of_budget", Ложь) Тогда
			Объект.ВидБюджета = Перечисления.ВидБюджета.Приход;
		Иначе
			Объект.ВидБюджета = Перечисления.ВидБюджета.Расход;
		КонецЕсли;
		ЗаполнитьГрафикДокумента(Объект.График, ПолучитьЗначениеJSON(ПолезнаяНагрузка, "graphics"), "Период");
	ИначеЕсли Маршрут = "auto-payments" Тогда
		Объект.Номер = ПолучитьЗначениеJSON(ПолезнаяНагрузка, "number");
		Объект.Дата = ПолучитьДатуJSON(ПолезнаяНагрузка, "date");
		Объект.Сумма = ПолучитьЧислоJSON(ПолезнаяНагрузка, "amount");
		Объект.ДатаНачала = ПолучитьДатуJSON(ПолезнаяНагрузка, "date_start");
		Объект.Комментарий = ПолучитьЗначениеJSON(ПолезнаяНагрузка, "comment");
		Объект.КошелекОткуда = ПолучитьСсылкуПоМаршруту("wallets", ПолучитьЗначениеJSON(ПолезнаяНагрузка, "wallet_out"));
		Объект.КошелекКуда = ПолучитьСсылкуПоМаршруту("wallets", ПолучитьЗначениеJSON(ПолезнаяНагрузка, "wallet_in"));
		Объект.Статья = ПолучитьСсылкуПоМаршруту("cash-flow-items", ПолучитьЗначениеJSON(ПолезнаяНагрузка, "cash_flow_item"));
		Объект.ЭтоПеревод = ПолучитьЗначениеJSON(ПолезнаяНагрузка, "is_transfer", Ложь);
		Объект.КолвоМесяцев = ПолучитьЧислоJSON(ПолезнаяНагрузка, "amount_month");
		Объект.ПометкаУдаления = ПолучитьЗначениеJSON(ПолезнаяНагрузка, "deleted", Ложь);
		ЗаполнитьГрафикДокумента(Объект.График, ПолучитьЗначениеJSON(ПолезнаяНагрузка, "graphics"), "Период");
	Иначе
		ВызватьИсключение СтрШаблон("Маршрут %1 не поддерживается для загрузки из Django.", Маршрут);
	КонецЕсли;
КонецПроцедуры

Процедура ПрименитьИзменениеСайта(Изменение)
	Маршрут = ПолучитьЗначениеJSON(Изменение, "route", "");
	Операция = ПолучитьЗначениеJSON(Изменение, "operation", "");
	ПолезнаяНагрузка = ПолучитьЗначениеJSON(Изменение, "payload");
	Идентификатор = ПолучитьЗначениеJSON(ПолезнаяНагрузка, "id", "");
	
	Если ПустаяСтрока(Маршрут) Тогда
		ВызватьИсключение "В изменении сайта не указан маршрут.";
	КонецЕсли;
	Если ПустаяСтрока(Идентификатор) Тогда
		ВызватьИсключение "В payload не указан идентификатор объекта.";
	КонецЕсли;
	
	Если Операция = "delete" Тогда
		ПрименитьПометкуУдаления(Маршрут, Идентификатор, ПолезнаяНагрузка);
		Возврат;
	КонецЕсли;
	
	Объект = ПолучитьИлиСоздатьОбъектПоМаршруту(Маршрут, Идентификатор);
	ЗаполнитьОбъектИзСайта(Маршрут, Объект, ПолезнаяНагрузка);
	ЗаписатьОбъектИзОбмена(Объект);
КонецПроцедуры

Функция ПодтвердитьИзмененияСайта(МассивИдентификаторов) Экспорт
	ДанныеДляЗапроса = Новый Структура;
	ДанныеДляЗапроса.Вставить("ids", МассивИдентификаторов);
	Возврат ОтправитьHTTPЗапрос("POST", "api/v1/onec-sync/outbox/ack/", ДанныеДляЗапроса);
КонецФункции

Функция ЗагрузитьИзмененияСайта(Лимит = Неопределено) Экспорт
	РезультатЗагрузки = Новый Структура;
	РезультатЗагрузки.Вставить("Получено", 0);
	РезультатЗагрузки.Вставить("Применено", 0);
	РезультатЗагрузки.Вставить("Подтверждено", 0);
	
	ЛимитЗагрузки = ПолучитьЛимитЗагрузкиИзмененийСайта(Лимит);
	СтрокаЛимита = ПолучитьСтрокуЛимитаОчередиСинхронизации(ЛимитЗагрузки);
	РезультатHTTP = ОтправитьHTTPЗапрос("GET", СтрШаблон("api/v1/onec-sync/outbox/?limit=%1", СтрокаЛимита));
	Если НЕ ЭтоУспешныйКодHTTP(РезультатHTTP.Код) Тогда
		ВызватьИсключение РезультатHTTP.Тело;
	КонецЕсли;
	
	ТелоОтвета = ТекстJSONВОбъект(РезультатHTTP.Тело);
	Изменения = ПолучитьЗначениеJSON(ТелоОтвета, "results", Новый Массив);
	РезультатЗагрузки.Вставить("Получено", Изменения.Количество());
	
	Если Изменения.Количество() = 0 Тогда
		Возврат РезультатЗагрузки;
	КонецЕсли;
	
	МассивПодтверждений = Новый Массив;
	Для каждого Изменение Из Изменения Цикл
		Попытка
			ПрименитьИзменениеСайта(Изменение);
			МассивПодтверждений.Добавить(ПолучитьЗначениеJSON(Изменение, "id"));
			УвеличитьЗначениеСтруктуры(РезультатЗагрузки, "Применено");
		Исключение
			ЗаписьЖурналаРегистрации("Django", УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	
	Если МассивПодтверждений.Количество() > 0 Тогда
		РезультатПодтверждения = ПодтвердитьИзмененияСайта(МассивПодтверждений);
		Если ЭтоУспешныйКодHTTP(РезультатПодтверждения.Код) Тогда
			РезультатЗагрузки.Вставить("Подтверждено", МассивПодтверждений.Количество());
		Иначе
			ЗаписьЖурналаРегистрации("Django", УровеньЖурналаРегистрации.Ошибка,,,РезультатПодтверждения.Тело);
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатЗагрузки;
КонецФункции

#КонецОбласти
	 
	 
#Область JSON
Функция СформироватьJSON(ДанныеДляЗапроса)  
	ДанныеJSON = "";
	Попытка
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку( Новый ПараметрыЗаписиJSON(,Символы.Таб));
		НастройкиСериализацииJSON = Новый НастройкиСериализацииJSON;
		НастройкиСериализацииJSON.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением;
		НастройкиСериализацииJSON.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
		ЗаписатьJSON(ЗаписьJSON,ДанныеДляЗапроса,НастройкиСериализацииJSON);
		Возврат ЗаписьJSON.Закрыть()
	Исключение
	    ЗаписьЖурналаРегистрации("Django", УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
	КонецПопытки;
		
КонецФункции

Функция ТекстJSONВОбъект(Строка)
	Результат = Неопределено;
	ЧтениеJSON = Новый ЧтениеJSON;
	
	Попытка
		ЧтениеJSON.УстановитьСтроку(Строка);
		//выгружаю с Истина (в соответствие вместо структуры) т.к. возвращало в ключе число и структура выдавала ошибку
		Результат = ПрочитатьJSON(ЧтениеJSON, Истина);
	Исключение
		ЗаписьЖурналаРегистрации("Django", УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
		
	КонецПопытки;
	Возврат Результат;
КонецФункции   

Функция ОбъектВТекстJSON(ДанныеДляЗапроса)
	ЗаписьJOIN = Новый ЗаписьJSON;
	ЗаписьJOIN.УстановитьСтроку();	
	ЗаписатьJSON(ЗаписьJOIN,ДанныеДляЗапроса);
	Возврат ЗаписьJOIN.Закрыть();
	
КонецФункции

#КонецОбласти




#Область Подписки_на_события
Процедура Dj_РегистрацияИзмененийПриЗаписиПриЗаписи(Источник, Отказ) Экспорт
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Истина);
	РегистрыСведений.DjСписокОбменаССайтом.ДобавитьЗапись(Источник.Ссылка);
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

#КонецОбласти      


#Область Обмен
Функция ОтправитьОбъектНаСайт(СсылкаНаОбъект)
	Если ТипЗнч(СсылкаНаОбъект) = Тип("СправочникСсылка.Статьи") Тогда
		Если НЕ СсылкаНаОбъект.Родитель.Пустая() Тогда
			Результат = ОтправитьОбъектНаСайт(СсылкаНаОбъект.Родитель);
			Если НЕ ЭтоУспешныйКодHTTP(Результат.Код) Тогда
				Возврат Результат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	МассивДанных = СформироватьМаршрутИДанныеДляЗапроса(СсылкаНаОбъект);
	Для каждого МаршрутИДанныеДляЗапроса Из МассивДанных Цикл
		Метод = ПолучитьЗначениеJSON(МаршрутИДанныеДляЗапроса, "Метод", "");
		АдресРесурса = ПолучитьЗначениеJSON(МаршрутИДанныеДляЗапроса, "АдресРесурса", "");
		Если ЗначениеЗаполнено(Метод) И ЗначениеЗаполнено(АдресРесурса) Тогда
			Результат = ОтправитьHTTPЗапрос(Метод, АдресРесурса, МаршрутИДанныеДляЗапроса.ДанныеДляЗапроса);
		Иначе
			//Проверка на существование
			Результат = ОтправитьHTTPЗапрос("HEAD",ПолучитьАдресРесурса(МаршрутИДанныеДляЗапроса.Маршрут,СсылкаНаОбъект));
			Если Результат.Код = 200 Тогда
				Результат = ОтправитьHTTPЗапрос("PATCH",ПолучитьАдресРесурса(МаршрутИДанныеДляЗапроса.Маршрут,СсылкаНаОбъект),МаршрутИДанныеДляЗапроса.ДанныеДляЗапроса);
			ИначеЕсли Результат.Код = 404 Тогда
				Результат = ОтправитьHTTPЗапрос("POST",ПолучитьАдресРесурса(МаршрутИДанныеДляЗапроса.Маршрут),МаршрутИДанныеДляЗапроса.ДанныеДляЗапроса);
			КонецЕсли;
		КонецЕсли;
		Если НЕ ЭтоУспешныйКодHTTP(Результат.Код) Тогда
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции 

Функция СформироватьМаршрутИДанныеДляЗапроса(СсылкаНаОбъект)
	МаршрутИДанныеДляЗапроса = Новый Структура;
	ДанныеДляЗапроса = Новый Структура; 
	МассивДанных = новый Массив;
	Если ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.Автоплатежи") Тогда
		//Основной документ
		МаршрутИДанныеДляЗапроса = Новый Структура;
		ДанныеДляЗапроса = Новый Структура; 
		МаршрутИДанныеДляЗапроса.Вставить("Маршрут","auto-payments");
		ДанныеДляЗапроса.Вставить("id",XMLСтрока(СсылкаНаОбъект));
		ДанныеДляЗапроса.Вставить("number",СсылкаНаОбъект.Номер);
		ДанныеДляЗапроса.Вставить("date", СсылкаНаОбъект.Дата);
		ДанныеДляЗапроса.Вставить("deleted",СсылкаНаОбъект.ПометкаУдаления);
		
		ДанныеДляЗапроса.Вставить("wallet_in",?(СсылкаНаОбъект.КошелекКуда.Пустая(),Неопределено,XMLСтрока(СсылкаНаОбъект.КошелекКуда)));
		ДанныеДляЗапроса.Вставить("wallet_out",?(СсылкаНаОбъект.КошелекОткуда.Пустая(),Неопределено,XMLСтрока(СсылкаНаОбъект.КошелекОткуда)));
		ДанныеДляЗапроса.Вставить("cash_flow_item",?(СсылкаНаОбъект.Статья.Пустая(),Неопределено,XMLСтрока(СсылкаНаОбъект.Статья)));
		ДанныеДляЗапроса.Вставить("is_transfer",СсылкаНаОбъект.ЭтоПеревод);
		ДанныеДляЗапроса.Вставить("amount_month",СсылкаНаОбъект.КолвоМесяцев);
		ДанныеДляЗапроса.Вставить("amount",СсылкаНаОбъект.Сумма);
		ДанныеДляЗапроса.Вставить("comment",СсылкаНаОбъект.Комментарий);
		ДанныеДляЗапроса.Вставить("date_start", СсылкаНаОбъект.ДатаНачала);
        МаршрутИДанныеДляЗапроса.Вставить("ДанныеДляЗапроса",ДанныеДляЗапроса);	
		МассивДанных.Добавить(МаршрутИДанныеДляЗапроса); 
		
		//Атомарная замена графика через document-level endpoint Django.
		МассивДанных.Добавить(
			СформироватьЗапросЗаменыГрафика(
				СтрШаблон("api/v1/auto-payments/%1/replace-graphics/", XMLСтрока(СсылкаНаОбъект)),
				СформироватьСтрокиГрафикаДляЗапроса(СсылкаНаОбъект.График, "Период")
			)
		);
	ИначеЕсли ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.Бюджет") Тогда
	    //Основной документ
		МаршрутИДанныеДляЗапроса = Новый Структура;
		ДанныеДляЗапроса = Новый Структура; 

		МаршрутИДанныеДляЗапроса.Вставить("Маршрут","budgets");   
		МаршрутИДанныеДляЗапроса.Вставить("ДанныеДляЗапроса",ДанныеДляЗапроса);	
		МассивДанных.Добавить(МаршрутИДанныеДляЗапроса);
		ДанныеДляЗапроса.Вставить("id",XMLСтрока(СсылкаНаОбъект));
		ДанныеДляЗапроса.Вставить("number",СсылкаНаОбъект.Номер);
		ДанныеДляЗапроса.Вставить("date", СсылкаНаОбъект.Дата);
		ДанныеДляЗапроса.Вставить("deleted",СсылкаНаОбъект.ПометкаУдаления);
		
		ДанныеДляЗапроса.Вставить("cash_flow_item",?(СсылкаНаОбъект.Статья.Пустая(),Неопределено,XMLСтрока(СсылкаНаОбъект.Статья)));
		ДанныеДляЗапроса.Вставить("amount_month",СсылкаНаОбъект.КолвоМесяцев);
		ДанныеДляЗапроса.Вставить("amount",СсылкаНаОбъект.Сумма);
		ДанныеДляЗапроса.Вставить("date_start", СсылкаНаОбъект.ДатаНачала);
		ДанныеДляЗапроса.Вставить("comment",СсылкаНаОбъект.Комментарий);
		ДанныеДляЗапроса.Вставить("project",?(СсылкаНаОбъект.Проект.Пустая(),Неопределено,XMLСтрока(СсылкаНаОбъект.Проект)));
		ДанныеДляЗапроса.Вставить("type_of_budget",СсылкаНаОбъект.ВидБюджета = Перечисления.ВидБюджета.Приход);
		
		//Атомарная замена графика через document-level endpoint Django.
		МассивДанных.Добавить(
			СформироватьЗапросЗаменыГрафика(
				СтрШаблон("api/v1/budgets/%1/replace-graphics/", XMLСтрока(СсылкаНаОбъект)),
				СформироватьСтрокиГрафикаДляЗапроса(СсылкаНаОбъект.График, "Период")
			)
		);

     
	ИначеЕсли ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.Переводы") Тогда
		//Основной документ
		МаршрутИДанныеДляЗапроса= Новый Структура;
		ДанныеДляЗапроса = Новый Структура; 
		МаршрутИДанныеДляЗапроса.Вставить("Маршрут","transfers"); 
		ДанныеДляЗапроса.Вставить("id",XMLСтрока(СсылкаНаОбъект));
		ДанныеДляЗапроса.Вставить("number",СсылкаНаОбъект.Номер);
		ДанныеДляЗапроса.Вставить("date", СсылкаНаОбъект.Дата);
		ДанныеДляЗапроса.Вставить("deleted",СсылкаНаОбъект.ПометкаУдаления);
		
		ДанныеДляЗапроса.Вставить("wallet_out",?(СсылкаНаОбъект.КошелекОткуда.Пустая(),Неопределено,XMLСтрока(СсылкаНаОбъект.КошелекОткуда)));
		ДанныеДляЗапроса.Вставить("wallet_in",?(СсылкаНаОбъект.КошелекКуда.Пустая(),Неопределено,XMLСтрока(СсылкаНаОбъект.КошелекКуда)));
		ДанныеДляЗапроса.Вставить("cash_flow_item",?(СсылкаНаОбъект.Статья.Пустая(),Неопределено,XMLСтрока(СсылкаНаОбъект.Статья)));
		ДанныеДляЗапроса.Вставить("amount",СсылкаНаОбъект.Сумма);
		ДанныеДляЗапроса.Вставить("comment",СсылкаНаОбъект.Комментарий);
		ДанныеДляЗапроса.Вставить("include_in_budget",СсылкаНаОбъект.УчитыватьВБюджете);
		
		
		
        МаршрутИДанныеДляЗапроса.Вставить("ДанныеДляЗапроса",ДанныеДляЗапроса);	
		МассивДанных.Добавить(МаршрутИДанныеДляЗапроса);
		
		//Атомарная замена графика через document-level endpoint Django.
		МассивДанных.Добавить(
			СформироватьЗапросЗаменыГрафика(
				СтрШаблон("api/v1/transfers/%1/replace-graphics/", XMLСтрока(СсылкаНаОбъект)),
				СформироватьСтрокиГрафикаДляЗапроса(СсылкаНаОбъект.БюджетныйПериод, "ПериодБюджетирования")
			)
		);
	ИначеЕсли ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.Приходы") Тогда
		МаршрутИДанныеДляЗапроса.Вставить("Маршрут","receipts");   
		ДанныеДляЗапроса.Вставить("id",XMLСтрока(СсылкаНаОбъект));
		ДанныеДляЗапроса.Вставить("number",СсылкаНаОбъект.Номер);
		ДанныеДляЗапроса.Вставить("date", СсылкаНаОбъект.Дата);
		ДанныеДляЗапроса.Вставить("deleted",СсылкаНаОбъект.ПометкаУдаления);
		ДанныеДляЗапроса.Вставить("wallet",?(СсылкаНаОбъект.Кошелек.Пустая(),Неопределено,XMLСтрока(СсылкаНаОбъект.Кошелек)));
		ДанныеДляЗапроса.Вставить("cash_flow_item",?(СсылкаНаОбъект.Статья.Пустая(),Неопределено,XMLСтрока(СсылкаНаОбъект.Статья)));
		ДанныеДляЗапроса.Вставить("amount",СсылкаНаОбъект.Сумма);
		ДанныеДляЗапроса.Вставить("comment",СсылкаНаОбъект.Комментарий);
		МаршрутИДанныеДляЗапроса.Вставить("ДанныеДляЗапроса",ДанныеДляЗапроса);	   	    
        МассивДанных.Добавить(МаршрутИДанныеДляЗапроса);           		
	ИначеЕсли ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.Расходы") Тогда
		//Основной документ
		МаршрутИДанныеДляЗапроса= Новый Структура;
		ДанныеДляЗапроса = Новый Структура; 
	    МаршрутИДанныеДляЗапроса.Вставить("Маршрут","expenditures");
		ДанныеДляЗапроса.Вставить("id",XMLСтрока(СсылкаНаОбъект));
		ДанныеДляЗапроса.Вставить("number",СсылкаНаОбъект.Номер);
		ДанныеДляЗапроса.Вставить("date", СсылкаНаОбъект.Дата);
		ДанныеДляЗапроса.Вставить("amount",СсылкаНаОбъект.Сумма);
		ДанныеДляЗапроса.Вставить("comment",СсылкаНаОбъект.Комментарий);
		ДанныеДляЗапроса.Вставить("wallet",?(СсылкаНаОбъект.Кошелек.Пустая(),Неопределено,XMLСтрока(СсылкаНаОбъект.Кошелек)));
		ДанныеДляЗапроса.Вставить("cash_flow_item",XMLСтрока(СсылкаНаОбъект.Статья));
		ДанныеДляЗапроса.Вставить("deleted",СсылкаНаОбъект.ПометкаУдаления);
		ДанныеДляЗапроса.Вставить("include_in_budget",СсылкаНаОбъект.УчитыватьВБюджете);
		
        МаршрутИДанныеДляЗапроса.Вставить("ДанныеДляЗапроса",ДанныеДляЗапроса);	
		МассивДанных.Добавить(МаршрутИДанныеДляЗапроса);
		
		//Атомарная замена графика через штатный endpoint Django.
		МассивДанных.Добавить(
			СформироватьЗапросЗаменыГрафика(
				СтрШаблон("api/v1/expenditures/%1/replace-graphics/", XMLСтрока(СсылкаНаОбъект)),
				СформироватьСтрокиГрафикаДляЗапроса(СсылкаНаОбъект.БюджетныйПериод, "ПериодБюджетирования")
			)
		);
		
	ИначеЕсли ТипЗнч(СсылкаНаОбъект) = Тип("СправочникСсылка.Кошельки") Тогда
		МаршрутИДанныеДляЗапроса.Вставить("Маршрут","wallets"); 
		
		ДанныеДляЗапроса.Вставить("id",XMLСтрока(СсылкаНаОбъект));
		ДанныеДляЗапроса.Вставить("code",СсылкаНаОбъект.Код);
		ДанныеДляЗапроса.Вставить("name",СсылкаНаОбъект.Наименование);
		ДанныеДляЗапроса.Вставить("deleted",СсылкаНаОбъект.ПометкаУдаления);
		ДанныеДляЗапроса.Вставить("hidden",СсылкаНаОбъект.Скрыть);
		МаршрутИДанныеДляЗапроса.Вставить("ДанныеДляЗапроса",ДанныеДляЗапроса);	
		МассивДанных.Добавить(МаршрутИДанныеДляЗапроса);
	ИначеЕсли ТипЗнч(СсылкаНаОбъект) = Тип("СправочникСсылка.Проекты") Тогда
		МаршрутИДанныеДляЗапроса.Вставить("Маршрут","projects");
		
		ДанныеДляЗапроса.Вставить("id",XMLСтрока(СсылкаНаОбъект));
		ДанныеДляЗапроса.Вставить("code",СсылкаНаОбъект.Код);
		ДанныеДляЗапроса.Вставить("name",СсылкаНаОбъект.Наименование);
		ДанныеДляЗапроса.Вставить("deleted",СсылкаНаОбъект.ПометкаУдаления);	
		МаршрутИДанныеДляЗапроса.Вставить("ДанныеДляЗапроса",ДанныеДляЗапроса);	
		МассивДанных.Добавить(МаршрутИДанныеДляЗапроса);
	ИначеЕсли ТипЗнч(СсылкаНаОбъект) = Тип("СправочникСсылка.Статьи") Тогда
		МаршрутИДанныеДляЗапроса.Вставить("Маршрут","cash-flow-items");         
		
		ДанныеДляЗапроса.Вставить("id",XMLСтрока(СсылкаНаОбъект));
		ДанныеДляЗапроса.Вставить("code",СсылкаНаОбъект.Код);
		ДанныеДляЗапроса.Вставить("name",СсылкаНаОбъект.Наименование);
		ДанныеДляЗапроса.Вставить("deleted",СсылкаНаОбъект.ПометкаУдаления);  
		Если СсылкаНаОбъект.ЭтоГруппа Тогда
			ДанныеДляЗапроса.Вставить("include_in_budget",Неопределено);
		Иначе
			ДанныеДляЗапроса.Вставить("include_in_budget",?(СсылкаНаОбъект.УчитыватьВБюджете = NULL,Неопределено,СсылкаНаОбъект.УчитыватьВБюджете));
		КонецЕсли;
		ДанныеДляЗапроса.Вставить("parent",?(СсылкаНаОбъект.Родитель.Пустая(),Неопределено,XMLСтрока(СсылкаНаОбъект.Родитель)));  
		МаршрутИДанныеДляЗапроса.Вставить("ДанныеДляЗапроса",ДанныеДляЗапроса);	
		МассивДанных.Добавить(МаршрутИДанныеДляЗапроса);
	ИначеЕсли ТипЗнч(СсылкаНаОбъект) = Тип("СправочникСсылка.Контрагенты") Тогда
		МаршрутИДанныеДляЗапроса.Вставить("Маршрут","users");
		МаршрутИДанныеДляЗапроса.Вставить("ДанныеДляЗапроса",Dj_Users.СформироватьДанныеДляЗапроса(
			СсылкаНаОбъект,
			?(ЗначениеЗаполнено(СсылкаНаОбъект.Пароль), СсылкаНаОбъект.Пароль, Неопределено)
		));
		МассивДанных.Добавить(МаршрутИДанныеДляЗапроса);
	КонецЕсли;
	
	Возврат МассивДанных;	
	
КонецФункции

Процедура ОтработатьОчередьОбновлений()    Экспорт 
	ТипыДокументов = Новый Массив;
    Для каждого метаДок Из Метаданные.Документы Цикл
        ТипыДокументов.Добавить(Тип("ДокументСсылка." + метаДок.Имя));
    КонецЦикла;
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	DjСписокОбменаССайтом.СсылкаОбъект КАК СсылкаОбъект,
    |	ВЫБОР
    |		КОГДА ТИПЗНАЧЕНИЯ(DjСписокОбменаССайтом.СсылкаОбъект) В (&ТипыДокументов)
    |			ТОГДА ИСТИНА
    |		ИНАЧЕ ЛОЖЬ
    |	КОНЕЦ КАК ЭтоДокумент,
    |	DjСписокОбменаССайтом.СсылкаОбъект.ЭтоГруппа КАК ЭтоГруппа
    |ИЗ
    |	РегистрСведений.DjСписокОбменаССайтом КАК DjСписокОбменаССайтом
    |
    |УПОРЯДОЧИТЬ ПО
    |	ЭтоДокумент,
    |	ЭтоГруппа УБЫВ";
    Запрос.УстановитьПараметр("ТипыДокументов", ТипыДокументов);
    
    Выборка = Запрос.Выполнить().Выбрать();
    
	МассивУспешных = Новый Массив;
	Пока Выборка.Следующий() Цикл 
		Попытка
			Результат = ОтправитьОбъектНаСайт(Выборка.СсылкаОбъект);
			Если Результат.Код = 200 или Результат.Код = 201 Тогда
				МассивУспешных.Добавить(Выборка.СсылкаОбъект);
			иначе
				ЗаписьЖурналаРегистрации("Django", УровеньЖурналаРегистрации.Ошибка,,,Результат.Тело);
			КонецЕсли; 
			
		Исключение
		    ЗаписьЖурналаРегистрации("Django", УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
		КонецПопытки;
					
	КонецЦикла;	
	Для каждого ВыгруженныйОбъект Из МассивУспешных Цикл
		НаборЗаписей = РегистрыСведений.DjСписокОбменаССайтом.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.СсылкаОбъект.Установить(ВыгруженныйОбъект);
		НаборЗаписей.Записать();
	КонецЦикла;	
КонецПроцедуры

#КонецОбласти
